In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    'A' : [1, 2, 3],
    'B' : [10, 20, 30]
})

df2 = pd.DataFrame({
    'C' : [4, 5, 6],
    'D' : [40, 50, 60]
})

In [3]:
df1

   A   B
0  1  10
1  2  20
2  3  30

In [4]:
df2

   C   D
0  4  40
1  5  50
2  6  60

In [5]:
# Join df1 to df2

In [6]:
df1.join(df2)

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

In [7]:
df2.join(df1)

   C   D  A   B
0  4  40  1  10
1  5  50  2  20
2  6  60  3  30

In [8]:
# Adding index

In [9]:
df1 = pd.DataFrame({
    'A' : [1, 2, 3],
    'B' : [10, 20, 30]
}, index = ['a', 'b', 'c']
)

df2 = pd.DataFrame({
    'C' : [4, 5, 6],
    'D' : [40, 50, 60]
})

df1

   A   B
a  1  10
b  2  20
c  3  30

In [10]:
df2

   C   D
0  4  40
1  5  50
2  6  60

In [13]:
df1.join(df2)

   A   B   C   D
a  1  10 NaN NaN
b  2  20 NaN NaN
c  3  30 NaN NaN

In [15]:
# Putting the same index on df2

df1 = pd.DataFrame({
    'A' : [1, 2, 3],
    'B' : [10, 20, 30]
}, index = ['a', 'b', 'c']
)

df2 = pd.DataFrame({
    'C' : [4, 5],
    'D' : [40, 50]
    
}, index = ['a', 'b']
)

df1

   A   B
a  1  10
b  2  20
c  3  30

In [16]:
df2

   C   D
a  4  40
b  5  50

In [17]:
df1.join(df2)

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [18]:
df1.join(df2, how = 'right')

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [20]:
df1.join(df2, how = 'inner')

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [21]:
df1.join(df2, how = 'outer')

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [23]:
# df1 and df2 with same column names:
df1 = pd.DataFrame({
    'A' : [1, 2, 3],
    'B' : [10, 20, 30]
}, index = ['a', 'b', 'c']
)

df2 = pd.DataFrame({
    'A' : [4, 5],
    'B' : [40, 50]
    
}, index = ['a', 'b']
)

df1

   A   B
a  1  10
b  2  20
c  3  30

In [24]:
df2

   A   B
a  4  40
b  5  50

In [25]:
df1.join(df2)

ValueError: columns overlap but no suffix specified: Index(['A', 'B'], dtype='object')

In [26]:
# ^ Conflicting column name, we can resolve this by using:
# lsuffix or rsuffix

In [29]:
df1.join(df2, lsuffix= '_A', rsuffix= '_1')

   A_A  B_A  A_1   B_1
a    1   10  4.0  40.0
b    2   20  5.0  50.0
c    3   30  NaN   NaN